#### BuiltInFailures.ExtrusionFailures Members

---

|  |
| --- |
| BuiltInFailures ExtrusionFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ExtrusionFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotDrawExtrusions | Can't make Extrusion. |
| Public property Static member | CannotDrawExtrusionsError | Can't make Extrusion. |
| Public property Static member | ExtrusionTooThin | Extrusion is too thin. |
| Public property Static member | InvalidExtrusionCurveloop | Base sketch for extrusion is invalid. |
| Public property Static member | InvalidExtrusionCurveloopError | Base sketch for extrusion is invalid. |

# See Also

BuiltInFailures ExtrusionFailures Class

Autodesk.Revit.DB Namespace